using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp1
{
    public class Boss
    {
        // Вариант 8

        // Создать класс Boss с событиями Upgrade и Turn-on(под
        // определенным напряжением, учтите что техника или человек могут
        // сломаться). В main создать некоторое количество объектов(техники
        // или полу-техники). Подпишите объекты на события произвольным
        // образом.Реакция на события у разных объектов будет разная.
        // Проверить результаты изменения состояния объектов после
        // наступления событий, возможно не однократном.
    }
}
